/*********************************************************************
 **                             _ooOoo_                             **
 **                            o8888888o                            **
 **                            88" . "88                            **
 **                            (| -_- |)                            **
 **                            O\  =  /O                            **
 **                         ____/`---'\____                         **
 **                       .'  \\|     |//  `.                       **
 **                      /  \\|||  :  |||//  \                      **
 **                     /  _||||| -:- |||||-  \                     **
 **                     |   | \\\  -  /// |   |                     **
 **                     | \_|  ''\---/''  |   |                     **
 **                     \  .-\__  `-`  ___/-. /                     **
 **                   ___`. .'  /--.--\  `. . __                    **
 **                ."" '<  `.___\_<|>_/___.'  >'"".                 **
 **               | | :  `- \`.;`\ _ /`;.`/ - ` : | |               **
 **               \  \ `-.   \_ __\ /__ _/   .-` /  /               **
 **          ======`-.____`-.___\_____/___.-`____.-'======          **
 **                             `=---='                             **
 **          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^          **
 **                     佛祖保佑        永无BUG                     **
 **            佛曰:                                                **
 **                   写字楼里写字间，写字间里程序员；              **
 **                   程序人员写程序，又拿程序换酒钱。              **
 **                   酒醒只在网上坐，酒醉还来网下眠；              **
 **                   酒醉酒醒日复日，网上网下年复年。              **
 **                   但愿老死电脑间，不愿鞠躬老板前；              **
 **                   奔驰宝马贵者趣，公交自行程序员。              **
 **                   别人笑我忒疯癫，我笑自己命太贱；              **
 **                   不见满街漂亮妹，哪个归得程序员？              **
 *********************************************************************/
 /*=====================================================================
 * Copyright (c) 2018 All Rights Reserved.
 * CLRVer.:4.0.30319.42000
 * machinenameDESKTOP-U288O1H
 * namespace:Kasim.Core.Model.HtmlAgilityPack
 * filename:Music
 * guid:69a7d36b-e935-4488-bd03-731e20e5e45c
 * auth:lip86
 * date:2018-02-02 20:15:04
 * desc:
 *
 *=====================================================================*/
using System;
using System.Collections.Generic;
using System.Text;

namespace Kasim.Core.Model.HtmlAgilityPack
{
    public class Music
    {
        public string Id { get; set; }
        /// <summary>
        /// 歌名
        /// </summary>
        public string Name { get; set; }
        /// <summary>
        /// 歌手
        /// </summary>
        public string Artist { get; set; }
        /// <summary>
        /// 专辑
        /// </summary>
        public string Album { get; set; }
        
        public string Pay { get; set; }
        /// <summary>
        /// 歌曲地址
        /// </summary>
        public string Url { get; set; }

    }
}
